In [5]:
def my_sq(x):
    return x ** 2

In [7]:
my_sq(2)

4

In [13]:
def avg_2(x, y):
    """두 숫자의 평균을 구하는 함수
    """

    print(x)
    print(y)
    return (x + y) / 2

In [11]:
my_calc_1 = my_sq(4)
print(my_calc_1)

16

In [21]:
import pandas as pd

df = pd.DataFrame({"a": [10, 20, 30], 
                   "b": [20, 30, 40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [23]:
df['a']**2

0    100
1    400
2    900
Name: a, dtype: int64

In [25]:
df.a.apply(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [39]:
df.apply(avg_2,y=2)

0    10
1    20
2    30
Name: a, dtype: int64
2
0    20
1    30
2    40
Name: b, dtype: int64
2

      a     b
0   6.0  11.0
1  11.0  16.0
2  16.0  21.0

In [42]:
df.apply(avg_2,y=2,axis=1)

a    10
b    20
Name: 0, dtype: int64
2
a    20
b    30
Name: 1, dtype: int64
2
a    30
b    40
Name: 2, dtype: int64
2

      a     b
0   6.0  11.0
1  11.0  16.0
2  16.0  21.0

In [54]:
def avg_3(col):
    x = col[0]
    y = col[1]
    z = col[2]
    print (x,y,z)
    return (x+y+z)/3

In [56]:
df.apply(avg_3)

10 20 30
20 30 40

a    20.0
b    30.0
dtype: float64

In [58]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [84]:
def avg_4(col):
    print(col)
    x = col.iloc[0]
    y = col.iloc[1]
    print(x,y)
    return(x+y)/2

In [86]:
df[['a','b']].apply(avg_4,axis=1)

a    10
b    20
Name: 0, dtype: int64
10 20
a    20
b    30
Name: 1, dtype: int64
20 30
a    30
b    40
Name: 2, dtype: int64
30 40

0    15.0
1    25.0
2    35.0
dtype: float64

In [92]:
df[['a','b']].apply(lambda x:(x.iloc[0]+x.iloc[1])/2,axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [97]:
import pandas as pd

pd.read_csv('../data/concat_1.csv')
pd.read_csv('../data/concat_2.csv')
pd.read_csv('../data/concat_3.csv')

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [100]:
import pandas as pd

df1 = pd.read_csv('../data/concat_1.csv')
df2 = pd.read_csv('../data/concat_2.csv')
df3 = pd.read_csv('../data/concat_3.csv')

In [127]:
pd.concat([df1, df2, df3],axis=0,ignore_index=True)

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [120]:
new_s = pd.Series(['n1','n2','n3','n4'])
pd.concat([df1,new_s],axis=1)

    A   B   C   D   0
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4